package Project_3;
/*
*Добавить квартиру в список для аренды.
*Удалить квартиру из списка для аренды.
*Отсортировать квартиры по цене (по возрастанию) и вывести.
*Отсортировать квартиры по цене (по убыванию) и вывести.
*Сгруппировать квартиры по станции метро и вывести.
*Выбрать лучшую квартиру по оценке и вывести.
*Вывести изначальный список квартир для аренды.

Такой же функционал должен быть для типа «коммерческое помещение»
Общий функционал:

*Удалить всё из списков.
*Вывести сгруппированные списки. (Квартиры – список, Коммерческие
помещение - список).

 */
public class Main {
    public static void main(String[] args) {

    }
}
